
<!-- pr-auto-comment-tf/core -->
### ToFu - core
| Step | Outcome |
| ---- | ------- |
| :pencil2: **Format** | `success` |
| :wrench: **Init** ️| `success` |
| :mag: **Validate** | `success` |
| :page_facing_up: **Plan** | `success` |
| :passport_control: **Verify** | `success` |
| :point_right: **Result** | change(s): 14 to add, 0 to change, 0 to destroy. |

<details><summary>show change(s)</summary>

```
OpenTofu will perform the following actions:

  # gandi_livedns_domain.tl-org will be created
  + resource "gandi_livedns_domain" "tl-org" {
      + automatic_snapshots = true
      + id                  = (known after apply)
      + name                = "tahoe-lafs.org"

      + timeouts {
          + default = "10800s"
        }
    }

  # gandi_livedns_record.tl-org_A will be created
  + resource "gandi_livedns_record" "tl-org_A" {
      + href   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 10800
      + type   = "A"
      + values = [
          + "74.207.252.227",
        ]
      + zone   = "tahoe-lafs.org"
    }

  # gandi_livedns_record.tl-org_MX will be created
  + resource "gandi_livedns_record" "tl-org_MX" {
      + href   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 10800
      + type   = "MX"
      + values = [
          + "50 tahoe-lafs.org.",
        ]
      + zone   = "tahoe-lafs.org"
    }

  # gandi_livedns_record.tl-org_www will be created
  + resource "gandi_livedns_record" "tl-org_www" {
      + href   = (known after apply)
      + id     = (known after apply)
      + name   = "www"
      + ttl    = 10800
      + type   = "CNAME"
      + values = [
          + "tahoe-lafs.org.",
        ]
      + zone   = "tahoe-lafs.org"
    }

  # gandi_livedns_record.webforge_aliases["forge"] will be created
  + resource "gandi_livedns_record" "webforge_aliases" {
      + href   = (known after apply)
      + id     = (known after apply)
      + name   = "forge"
      + ttl    = 3600
      + type   = "CNAME"
      + values = [
          + "webforge.tahoe-lafs.org.",
        ]
      + zone   = "tahoe-lafs.org"
    }

  # gandi_livedns_record.webforge_aliases["live"] will be created
  + resource "gandi_livedns_record" "webforge_aliases" {
      + href   = (known after apply)
      + id     = (known after apply)
      + name   = "live"
      + ttl    = 3600
      + type   = "CNAME"
      + values = [
          + "webforge.tahoe-lafs.org.",
        ]
      + zone   = "tahoe-lafs.org"
    }

  # gandi_livedns_record.webforge_aliases["preview"] will be created
  + resource "gandi_livedns_record" "webforge_aliases" {
      + href   = (known after apply)
      + id     = (known after apply)
      + name   = "preview"
      + ttl    = 3600
      + type   = "CNAME"
      + values = [
          + "webforge.tahoe-lafs.org.",
        ]
      + zone   = "tahoe-lafs.org"
    }

  # gandi_livedns_record.webforge_ipv4 will be created
  + resource "gandi_livedns_record" "webforge_ipv4" {
      + href   = (known after apply)
      + id     = (known after apply)
      + name   = "webforge"
      + ttl    = 3600
      + type   = "A"
      + values = (known after apply)
      + zone   = "tahoe-lafs.org"
    }

  # gandi_livedns_record.webforge_ipv6 will be created
  + resource "gandi_livedns_record" "webforge_ipv6" {
      + href   = (known after apply)
      + id     = (known after apply)
      + name   = "webforge"
      + ttl    = 3600
      + type   = "AAAA"
      + values = (known after apply)
      + zone   = "tahoe-lafs.org"
    }

  # hcloud_rdns.webforge_ipv4 will be created
  + resource "hcloud_rdns" "webforge_ipv4" {
      + dns_ptr    = "webforge.tahoe-lafs.org"
      + id         = (known after apply)
      + ip_address = (known after apply)
      + server_id  = (known after apply)
    }

  # hcloud_rdns.webforge_ipv6 will be created
  + resource "hcloud_rdns" "webforge_ipv6" {
      + dns_ptr    = "webforge.tahoe-lafs.org"
      + id         = (known after apply)
      + ip_address = (known after apply)
      + server_id  = (known after apply)
    }

  # hcloud_server.webforge will be created
  + resource "hcloud_server" "webforge" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = true
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "debian-12"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "env"    = "prod"
          + "source" = "tf-tahoe-lafs-core"
        }
      + location                   = "hel1"
      + name                       = "webforge"
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx32"
      + shutdown_before_deletion   = false
      + ssh_keys                   = [
          + "tf-benoit-000619776016",
          + "tf-florian-000018054987",
        ]
      + status                     = (known after apply)
      + user_data                  = "8fL+4BE7QHom0AK2E96oM/BFPbU="
    }

  # hcloud_ssh_key.ssh_keys["tf-benoit-000619776016"] will be created
  + resource "hcloud_ssh_key" "ssh_keys" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "tf-benoit-000619776016"
      + public_key  = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIIZtWY7t8HVnaz6bluYsrAlzZC3MZtb8g0nO5L5fCQKR benoit@leastauthority.com"
    }

  # hcloud_ssh_key.ssh_keys["tf-florian-000018054987"] will be created
  + resource "hcloud_ssh_key" "ssh_keys" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "tf-florian-000018054987"
      + public_key  = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJlPneIaRT/mqu13N83ctEftub4O6zAfi6qgzZKerU5o florian@leastauthority.com"
    }

Plan: 14 to add, 0 to change, 0 to destroy.
```

</details>

<details><summary>show error(s)</summary>

```

```

</details>

*Pusher: @btlogy, Action: `pull_request`*
*Workflow: `LeastAuthority/tahoe-infrastructure/.github/workflows/tf-core.yml@refs/pull/1/merge`*